  clplim: proc options(main);
    dcl clplis entry;
    put skip list(' CLPLIM Starting');
    %include clinclp;
    call clplis;
    put skip list(' CLPLIM Ending');
 end clplim;