BB23   IDENTIFICATION DIVISION.
BB23   PROGRAM-ID.       CWXTCOB3.
BB23  ******************************************************************
BB23  *   DEMO AXA 1                                                   *
BB23  *****       C O M P U W A R E   C O R P O R A T I O N       ******
BB23  *                                                                *
BB23  *  THIS PROGRAM IS THE COBOL DEMO PROGRAM USED FOR XPEDITER/TSO  *
BB23  *  TRAINING SESSIONS
BB23  *
BB23  *  Démonstration d'une difference 2
BB23  *
BB23  *                                                                *
BB23  *  INPUT FILE  - EMPLOYEE WAGE INFORMATION                       *
BB23  *              - STORED saaaIN XPEDITER/TSO SAMPLIB (
BB23  *            CWXDATA)       *
BB23  *  OUTPUT FILE - EMPLOYEE COMPENSATION REPORT                    *
BB23  *              - REGIONAL SALES REPORT                           *
BB23  *                                                                *
BB23  *  RUN JCL     - STORED IN XPEDITER/TSO SAMPLIB (CWXTJCLC)       *
BB23  *                                                                *
BB23  ******************************************************************
BB23   ENVIRONMENT DIVISION.
BB23   INPUT-OUTPUT SECTION.
BB23
BB23   FILE-CONTROL.
BB23       SELECT EMPLOYEE-FILE ASSIGN TO EMPFILE.
BB23       SELECT REPORT-FILE   ASSIGN TO RPTFILE.
BB23   DATA DIVISION.
BB23   FILE SECTION.
BB23   FD  EMPLOYEE-FILE
BB23       LABEL RECORDS ARE STANDARD
BB23       BLOCK CONTAINS 0 RECORDS
BB23       RECORDING MODE IS F.
BB23   01  EMPLOYEE-RECORD            PIC X(80).
BB23   FD  REPORT-FILE
BB23       LABEL RECORDS ARE STANDARD
BB23       BLOCK CONTAINS 0 RECORDS
BB23       RECORDING MODE IS F.
BB23   01  REPORT-RECORD              PIC X(80).
BB23   WORKING-STORAGE SECTION.
BB23   01  SWITCHES.
BB23       05  JUMP-SW                PIC X        VALUE 'N'.
BB23           88  JUMPING                         VALUE 'Y'.
BB23       05  EOF-SW                 PIC X        VALUE 'N'.
BB23           88  END-OF-FILE                     VALUE 'Y'.
BB23       05  REGION-ERROR-SW        PIC X        VALUE 'N'.
BB23           88  INVALID-REGION                  VALUE 'Y'.
BB23           88  VALID-REGION                    VALUE 'N'.
BB23       05  PARM-ERROR-SW          PIC X        VALUE 'N'.
BB23           88  BAD-PARM                        VALUE 'Y'.
BB23           88  GOOD-PARM                       VALUE 'N'.
BB23       05  END-OF-MONTH-SW        PIC X        VALUE '?'.
BB23           88  END-OF-MONTH                    VALUE 'Y'.
BB23   01  COUNTERS.
BB23       05  PAGE-COUNT             PIC 9(3)     VALUE 1.
BB23       05  EMP-LINE-COUNT         PIC S99      VALUE +56.
BB23       05  REG-LINE-COUNT         PIC S99      VALUE +56.
BB23       05  START-NUMBER           PIC 999.
BB23       05  RECORDS-READ           PIC 999      VALUE 0.
BB23       05  NORTH-COUNT            PIC 9(2)     VALUE 0.
BB23       05  SOUTH-COUNT            PIC 9(2)     VALUE 0.
BB23       05  EAST-COUNT             PIC 9(2)     VALUE 0.
BB23       05  WEST-COUNT             PIC 9(2)     VALUE 0.
BB23   01  REGION-SUB                 PIC 9        VALUE 0.
BB23   01  YRS-OF-SERVICE             PIC 99       VALUE 0.
BB23   01  TODAYS-DATE                PIC X(6).
BB23   01  DATE-FIELDS REDEFINES TODAYS-DATE.
BB23       05  DATE-YY                PIC 9(2).
BB23       05  DATE-MM                PIC 9(2).
BB23       05  DATE-DD                PIC 9(2).
BB23  **
BB23  **  HOLD EMPLOYEE DETAIL PRINT LINES UNTIL READY TO PRINT
BB23  **  EMPLOYEE COMPENSATION REPORT.  THE DATA IS STORED BY
BB23  **  REGION AND THEN BY SEQUENCE IN EMPLOYEE FILE.
BB23  **
BB23   COPY HOLDTB.
BB23
BB23  **
BB23  **  STORES THE NAME OF EACH REGION
BB23  **
BB23   01  REGION-NAME-TABLE.
BB23       05  FILLER            PIC X(5)    VALUE 'NORTH'.
BB23       05  FILLER            PIC X(5)    VALUE 'SOUTH'.
BB23       05  FILLER            PIC X(5)    VALUE 'EAST '.
BB23       05  FILLER            PIC X(5)    VALUE 'WEST '.
BB23   01  REGION-TABLE     REDEFINES REGION-NAME-TABLE.
BB23       05  REGION-ID         PIC X(5)  OCCURS 4 TIMES.
BB23  **
BB23  **  STORES REGIONAL INFORMATION THAT IS USED TO PRINT THE
BB23  **  REGIONAL SALES REPORT.  REGION SALES IS A SUM OF ALL SALES
BB23  **  FOR THE REGION AND IS USED TO CALCULATE MANAGER COMMISSION
BB23  **  THE COMMENT FIELD IS USED TO FLAG A REGION IF AN EMPLOYEE IN
BB23  **  THE REGION HAS 0 SALES.
BB23  **
BB23   01  REGION-SALES-TABLE.
BB23       05  REGION-DATA         OCCURS 4 TIMES.
BB23           10  REGION-NAME       PIC X(5).
BB23           10  REGION-MANAGER    PIC X(15).
BB23           10  REGION-SALARY     PIC 9(4)V99.
BB23           10  REGION-SALES      PIC 9(6)V99.
BB23           10  REGION-COMMENT    PIC X(5).
BB23  **
BB23  **  FIELDS USED BY CALLED PROGRAM CWXTSUBC TO CALCULATE
BB23  **  COMMISSION BASED ON SALES AMOUNT
BB23  **
BB23   01  CALC-COMMISSION-FIELDS.
BB23       05  EMP-TYPE              PIC X.
BB23       05  CALC-SALES            PIC 9(6)V99           VALUE 0.
BB23       05  CALC-COMMISSION       PIC 9(5)V99  COMP-3   VALUE 0.
BB23  **
BB23  **  ACCUMULATORS USED FOR CALCULATING HOURLY EMPLOYEE WAGES,
BB23  **  TOTAL EMPLOYEE COMPENSATION (SALARY PLUS COMMISSION OR
BB23  **  HOURLY EMPLOYEE WAGES PLUS OVERTIME), AND TOTAL MANAGEMENT
BB23  **  COMPENSATION (SALARY PLUS COMMISSION BASED ON TOTAL SALES
BB23  **  FOR THE REGION)
BB23  **
BB23   01  TOTAL-FIELDS.
BB23       05  EMP-WAGES             PIC 9(5)V99    COMP-3.
BB23       05  EMP-COMPENSATION      PIC 9(5)V99    COMP-3.
BB23       05  MGMT-COMPENSATION     PIC 9(5)V99    COMP-3.
BB23  **
BB23  **  TOTAL COMPENSATION GIVEN TO ALL EMPLOYEES (HOURLY AND SALES)
BB23  **  OR MANAGEMENT.  EACH SUM IS PRINTED AT THE END OF THEIR
BB23  **  RESPECTIVE REPORTS.
BB23  **
BB23   01  GRAND-TOTAL-FIELDS.
BB23       05  GRAND-TOTAL-EMP       PIC 9(7)V99   COMP-3  VALUE 0.
BB23       05  GRAND-TOTAL-MGMT      PIC 9(7)V99   COMP-3  VALUE 0.
BB23  **
BB23  **  USED FOR CALCULATING OVERTIME FOR ANY HOURLY EMPLOYEE
BB23  **  WHOSE HOURS EXCEEDS 40
BB23  **
BB23   01  OVERTIME-FIELDS.
BB23       05  OT-AMOUNT             PIC 9(5)V99    COMP-3.
BB23       05  OT-HOURS              PIC 9(2).
BB23  **
BB23  **  EMPLOYEE RECORD WORK-AREA.  EMPLOYEE DATA IS REDEFINED
BB23  **  BASED ON ONE OF THE 3 EMPLOYEE TYPES, HOURLY, SALES OR
BB23  **  MANAGEMENT.
BB23  **
BB23   01  EMPLOYEE-WORK-AREA.
BB23       05  WA-EMP-NUM            PIC 9(5).
BB23       05  WA-EMP-TYPE           PIC X.
BB23           88  HOURLY            VALUE 'H'.
BB23           88  SALES             VALUE 'S'.
BB23           88  MANAGEMENT        VALUE 'M'.
BB23       05  WA-EMP-REGION         PIC 9.
BB23           88  NORTH             VALUE 1.
BB23           88  SOUTH             VALUE 2.
BB23           88  EAST              VALUE 3.
BB23           88  WEST              VALUE 4.
BB23       05  WA-EMP-NAME           PIC X(15).
BB23       05  WA-EMP-ADDRESS.
BB23           10  WA-EMP-STREET     PIC X(15).
BB23           10  WA-EMP-CITY       PIC X(8).
BB23           10  WA-EMP-STATE      PIC XX.
BB23           10  WA-EMP-ZIP        PIC X(9).
BB23       05  WA-HOURLY-EMPLOYEE-DATA.
BB23           10  WA-EMP-HOURS      PIC 9(2).
BB23           10  WA-EMP-RATE       PIC 9(3)V99     COMP-3.
BB23           10  FILLER            PIC X(8).
BB23       05  WA-SALES-EMPLOYEE-DATA   REDEFINES
BB23                                    WA-HOURLY-EMPLOYEE-DATA.
BB23           10  WA-SALES-SALARY   PIC 9(5)V99     COMP-3.
BB23           10  WA-SALES-AMOUNT   PIC 9(5)V99.
BB23           10  FILLER            PIC X(2).
BB23       05  WA-MGMT-EMPLOYEE-DATA   REDEFINES
BB23                                    WA-SALES-EMPLOYEE-DATA.
BB23           10  WA-MGMT-SALARY    PIC 9(5)V99     COMP-3.
BB23           10  FILLER            PIC X(9).
BB23       05  WA-EMP-HIRE-DATE.
BB23           10  WA-EMP-HIRE-YY    PIC 9(2).
BB23           10  WA-EMP-HIRE-MM    PIC 9(2).
BB23           10  WA-EMP-HIRE-DD    PIC 9(2).
BB23       05  FILLER                PIC X(5).
BB23  ***
BB23  ***  EMPLOYEE COMPENSATION REPORT
BB23  ***
BB23   01  EMPLOYEE-HDR1.
BB23       05  FILLER      PIC X         VALUE SPACES.
BB23       05  FILLER      PIC X(10)
BB23                          VALUE  'RUN DATE  '.
BB23       05  EMP-RUN-MM
BB23                       PIC 99.
BB23       05  FILLER      PIC X         VALUE '/'.
BB23       05  EMP-RUN-DD
BB23                       PIC 99.
BB23       05  FILLER      PIC X         VALUE '/'.
BB23       05  EMP-RUN-YY
BB23                       PIC 99.
BB23       05  FILLER      PIC X(7)      VALUE SPACES.
BB23       05  FILLER      PIC X(28)
BB23                          VALUE  'EMPLOYEE COMPENSATION REPORT'.
BB23       05  FILLER      PIC X(18)     VALUE SPACES.
BB23       05  FILLER      PIC X(5)      VALUE 'PAGE '.
BB23       05  EMP-PAGE    PIC ZZ9.
BB23   01  EMPLOYEE-HDR2.
BB23       05  FILLER      PIC X(31)     VALUE SPACES.
BB23       05  FILLER      PIC X(4)      VALUE 'HIRE'.
BB23       05  FILLER      PIC X(2)      VALUE SPACES.
BB23       05  FILLER      PIC X(6)      VALUE 'YRS OF'.
BB23       05  FILLER      PIC X(37)     VALUE SPACES.
BB23   01  EMPLOYEE-HDR3.
BB23       05  FILLER      PIC X         VALUE SPACES.
BB23       05  FILLER      PIC X(13)     VALUE 'EMPLOYEE NAME'.
BB23       05  FILLER      PIC X(3)      VALUE SPACES.
BB23       05  FILLER      PIC X(6)      VALUE 'REGION'.
BB23       05  FILLER      PIC X         VALUE SPACES.
BB23       05  FILLER      PIC X(4)      VALUE 'TYPE'.
BB23       05  FILLER      PIC X(3)      VALUE SPACES.
BB23       05  FILLER      PIC X(4)      VALUE 'DATE'.
BB23       05  FILLER      PIC X(2)      VALUE SPACES.
BB23       05  FILLER      PIC X(7)      VALUE 'SERVICE'.
BB23       05  FILLER      PIC X(2)      VALUE SPACES.
BB23       05  FILLER      PIC X(6)      VALUE 'SALARY'.
BB23       05  FILLER      PIC X(3)      VALUE SPACES.
BB23       05  FILLER      PIC X(3)      VALUE 'O/T'.
BB23       05  FILLER      PIC X(3)      VALUE SPACES.
BB23       05  FILLER      PIC X(10)     VALUE 'COMMISSION'.
BB23       05  FILLER      PIC X(4)      VALUE SPACES.
BB23       05  FILLER      PIC X(5)      VALUE 'TOTAL'.
BB23   01  EMPLOYEE-DTL.
BB23       05  FILLER                  PIC X         VALUE SPACES.
BB23       05  EMP-DTL-NAME            PIC X(15).
BB23       05  FILLER                  PIC X         VALUE SPACES.
BB23       05  EMP-DTL-REGION          PIC X(5).
BB23       05  FILLER                  PIC X(3)      VALUE SPACES.
BB23       05  EMP-DTL-TYPE            PIC X.
BB23       05  FILLER                  PIC X(3)      VALUE SPACES.
BB23       05  EMP-DTL-HIRE-MM         PIC 9(2).
BB23       05  EMP-DTL-SLASH1          PIC X         VALUE SPACES.
BB23       05  EMP-DTL-HIRE-DD         PIC 9(2).
BB23       05  EMP-DTL-SLASH2          PIC X         VALUE SPACES.
BB23       05  EMP-DTL-HIRE-YY         PIC 9(2).
BB23       05  FILLER                  PIC X(3)      VALUE SPACES.
BB23       05  EMP-DTL-YRS-OF-SERVICE  PIC 9(2).
BB23       05  FILLER                  PIC X(2)      VALUE SPACES.
BB23       05  EMP-DTL-WAGES           PIC ZZZZ9.99.
BB23       05  FILLER                  PIC X         VALUE SPACES.
BB23       05  EMP-DTL-OT              PIC ZZZZ9.99.
BB23       05  FILLER                  PIC X(2)      VALUE SPACES.
BB23       05  EMP-DTL-COMM            PIC ZZZZ9.99.
BB23       05  FILLER                  PIC X         VALUE SPACES.
BB23       05  EMP-DTL-TOTAL           PIC ZZZZ9.99.
BB23   01  EMP-TOTAL-DTL.
BB23       05  FILLER            PIC X(4)      VALUE SPACES.
BB23       05  FILLER            PIC X(5)      VALUE 'TOTAL'.
BB23       05  FILLER            PIC X(61)     VALUE SPACES.
BB23       05  EMP-GRAND-TOTAL   PIC ZZZZZZ9.99.
BB23  ***
BB23  ***  REGIONAL SALES REPORT
BB23  ***
BB23   01  REGION-HDR1.
BB23       05  FILLER      PIC X      VALUE SPACES.
BB23       05  FILLER      PIC X(10)  VALUE 'RUN DATE  '.
BB23       05  REG-RUN-MONTH
BB23                       PIC 99.
BB23       05  FILLER      PIC X      VALUE '/'.
BB23       05  REG-RUN-DAY PIC 99.
BB23       05  FILLER      PIC X      VALUE '/'.
BB23       05  REG-RUN-YEAR
BB23                       PIC 99.
BB23       05  FILLER      PIC X(11)  VALUE SPACES.
BB23       05  FILLER      PIC X(21)  VALUE  'REGIONAL SALES REPORT'.
BB23       05  FILLER      PIC X(21)  VALUE SPACES.
BB23       05  FILLER      PIC X(5)   VALUE 'PAGE '.
BB23       05  REG-PAGE    PIC ZZ9.
BB23   01  REGION-HDR2.
BB23       05  FILLER      PIC X      VALUE SPACES.
BB23       05  FILLER      PIC X(7)   VALUE 'MANAGER'.
BB23       05  FILLER      PIC X(9)   VALUE SPACES.
BB23       05  FILLER      PIC X(6)   VALUE 'REGION'.
BB23       05  FILLER      PIC X(3)   VALUE SPACES.
BB23       05  FILLER      PIC X(11)  VALUE 'TOTAL SALES'.
BB23       05  FILLER      PIC X(5)   VALUE SPACES.
BB23       05  FILLER      PIC X(6)   VALUE 'SALARY'.
BB23       05  FILLER      PIC X(5)   VALUE SPACES.
BB23       05  FILLER      PIC X(10)  VALUE 'COMMISSION'.
BB23       05  FILLER      PIC X(3)   VALUE SPACES.
BB23       05  FILLER      PIC X(5)   VALUE 'TOTAL'.
BB23       05  FILLER      PIC X(9)   VALUE SPACES.
BB23   01  REGION-DETAIL.
BB23       05  FILLER             PIC X         VALUE SPACES.
BB23       05  REG-DTL-MANAGER    PIC X(15).
BB23       05  FILLER             PIC X         VALUE SPACES.
BB23       05  REG-DTL-REGION     PIC X(5).
BB23       05  FILLER             PIC X(5)      VALUE SPACES.
BB23       05  REG-DTL-SALES      PIC ZZZZZ9.99.
BB23       05  FILLER             PIC X(5)      VALUE SPACES.
BB23       05  REG-DTL-SALARY     PIC ZZZ9.99.
BB23       05  FILLER             PIC X(5)      VALUE SPACES.
BB23       05  REG-DTL-COMM       PIC ZZZZ9.99.
BB23       05  FILLER             PIC X(3)      VALUE SPACES.
BB23       05  REG-DTL-TOTAL      PIC ZZZZ9.99.
BB23       05  FILLER             PIC X         VALUE SPACES.
BB23       05  REG-DTL-COMMENT    PIC X(5).
BB23   01  MGMT-TOTAL-DTL.
BB23       05  FILLER             PIC X(4)      VALUE SPACES.
BB23       05  FILLER             PIC X(5)      VALUE 'TOTAL'.
BB23       05  FILLER             PIC X(53)     VALUE SPACES.
BB23       05  MGMT-GRAND-TOTAL   PIC ZZZZZZ9.99.
BB23       05  FILLER             PIC X(8)      VALUE SPACES.
BB23  ***
BB23  ***  ERROR MESSAGE LINE
BB23  ***
BB23   01  ERROR-LINE             PIC X(80).
BB23   01  CWXTDATE   PIC X(8)    VALUE 'CWXTDAT2'.
BB23   01  CWXTSUBC   PIC X(8)    Value 'CWXTSUB2'.
BB23  ***
BB23  ***  BLANK LINE TO CONTROL SPACING OF REPORTS
BB23  ***
BB23   01  BLANK-LINE             PIC X(80)   VALUE SPACES.
BB23  ***
BB23  ***  PARM IS AN OPTIONAL FIELD USED TO START PROCESSING
BB23  ***  AT A PARTICULAR RECORD IN THE EMPLOYEE FILE.  VALID
BB23  ***  VALUES FOR PARM-DATA ARE:
BB23  ***
BB23  ***        VALUE           FUNCTION
BB23  ***     - SPACES OR 00001  BEGIN PROCESSING FROM FIRST RECORD.
BB23  ***                          CAUSES S0C7 ABEND BECAUSE FIRST
BB23  ***                          RECORD CONTAINS INVALID DATA.
BB23  ***     - 00002            BEGIN PROCESSING FROM SECOND RECORD.
BB23  ***                          CAUSES S0C7 ABEND BECAUSE SECOND
BB23  ***                          RECORD CONTAINS INVALID REGION
BB23  ***                          CREATING TABLE OVERFLOW CONDITION.
BB23  ***     - 00003 THRU 00019 BEGIN PROCESSING AT SPECIFIED RECORD
BB23  ***                          UNTIL END-OF-FILE.  BYPASSES S0C7
BB23  ***                          CAUSED BY RECORDS 00001 AND 00002.
BB23  ***     - 00016 THRU 00019 PROCESS MANAGEMENT RECORDS AND PRINT
BB23  ***                          REGIONAL SALES REPORT ONLY.  IF
BB23  ***                          PARM > 16, ONE OR MORE MANAGER NAMES
BB23  ***                          WILL NOT APPEAR ON THE REPORT.
BB23  ***     - 00020 OR ABOVE   PRINTS MANAGEMENT REPORT WITHOUT
BB23  ***                          MANAGER NAMES AND ZERO VALUES.
BB23  ***     - NON NUMERIC OR   PRINTS ERROR MESSAGE AND SKIPS ALL
BB23  ***         < 5 CHARACTERS   PROCESSING.
BB23  ***
BB23   LINKAGE SECTION.
BB23   01  PARMINFO.
BB23       03  PARM-LTH           PIC S9(4) COMP.
BB23       03  PARM-DATA          PIC X(5).
BB23   PROCEDURE DIVISION USING PARMINFO.
BB23   0000-MAINLINE.
BB23       PERFORM 9000-OPEN.
BB23       PERFORM 9100-CHECK-PARM.
BB23       IF GOOD-PARM
BB23          PERFORM 9200-INIT
BB23          PERFORM 8000-READ-INPUT
BB23               UNTIL RECORDS-READ = START-NUMBER
BB23               OR END-OF-FILE
BB23          PERFORM 1000-PROCESS-DATA
BB23                UNTIL END-OF-FILE
BB23          PERFORM 6000-PRINT-EMPLOYEE-REPORT
BB23          MOVE 1 TO REGION-SUB
BB23  *        move WA-EMP-HIRE-DATE to WA-EMP-HIRE-DATE.
BB23          IF END-OF-MONTH
BB23              PERFORM 7000-PRINT-REGION-REPORT
BB23                    UNTIL REGION-SUB > 4.
BB23       PERFORM 9900-CLOSE.
BB23       GOBACK.
BB23  ***
BB23  ***  DIFFERENT PROCESSING OCCURS BASED ON EMPLOYEE TYPE.  THERE
BB23  ***  ARE 3 VALID EMPLOYEE TYPES.  IF A RECORD IS READ CONTAINING
BB23  ***  A RECORD TYPE OTHER THAN H, S OR M, AN ERROR MESSAGE IS
BB23  ***  WRITTEN AND PROCESSING CONTINUES.
BB23  ***
BB23   1000-PROCESS-DATA.
BB23       IF HOURLY
BB23           PERFORM 2000-PROCESS-HOURLY
BB23       ELSE
BB23           IF SALES
BB23               PERFORM 3000-PROCESS-SALES
BB23           ELSE
BB23               IF MANAGEMENT
BB23                   PERFORM 4000-PROCESS-MANAGEMENT
BB23               ELSE
BB23                   MOVE ' INVALID EMPLOYEE TYPE ' TO ERROR-LINE
BB23                   WRITE REPORT-RECORD FROM ERROR-LINE.
BB23  ***                       GO TO 9999-CAN-DELETE.
BB23       PERFORM 8000-READ-INPUT.
BB23  ***
BB23  ***  CALCULATE TYPE H (HOURLY) EMPLOYEE COMPENSATION.  ANY
BB23  ***  EMPLOYEE WITH MORE THAN 40 HOURS RECEIVES OVERTIME COMPUTED
BB23  ***  AT 1.5 TIMES THEIR HOURLY RATE.  ONCE EMPLOYEE COMPENSATION
BB23  ***  IS CALCULATED, IT IS STORED IN A HOLD TABLE.  THE DATA IN
BB23  ***  THE HOLD TABLE IS USED FOR PRINTING THE EMPLOYEE COMPENSATION
BB23  ***  REPORT.
BB23  ***
BB23   2000-PROCESS-HOURLY.
BB23       MOVE ZERO TO OT-AMOUNT.
BB23       IF WA-EMP-HOURS GREATER THAN 40
BB23           COMPUTE EMP-WAGES = WA-EMP-RATE * 40
BB23           COMPUTE OT-HOURS  = WA-EMP-HOURS - 40
BB23           COMPUTE OT-AMOUNT = OT-HOURS * (WA-EMP-RATE * 1.5)
BB23       ELSE
BB23           COMPUTE EMP-WAGES = WA-EMP-HOURS * WA-EMP-RATE.
BB23       COMPUTE EMP-COMPENSATION = EMP-WAGES + OT-AMOUNT.
BB23       ADD EMP-COMPENSATION TO GRAND-TOTAL-EMP.
BB23       CALL CWXTDATE USING END-OF-MONTH-SW
BB23                             YRS-OF-SERVICE
BB23                             TODAYS-DATE
BB23                             WA-EMP-HIRE-DATE.
BB23       PERFORM 5000-STORE-EMPLOYEE-DETAIL.
BB23       SET HOLD-IX UP BY 1.
BB23
BB23  ***
BB23  ***  CALCULATE TYPE S (SALES) EMPLOYEE COMPENSATION.  THE TOTAL
BB23  ***  SALES FOR THE EMPLOYEE IS PASSED TO THE CALLED PROGRAM WHICH
BB23  ***  CALCULATES COMMISSION.  ONCE EMPLOYEE COMPENSATION IS
BB23  ***  RETURNED FROM CWXTSUBC, IT IS STORED IN A HOLD-TABLE.  THE
BB23  ***  DATA IN THE HOLD-TABLE IS USED FOR PRINTING THE EMPLOYEE
BB23  ***  COMPENSATION REPORT.
BB23  ***
BB23   3000-PROCESS-SALES.
BB23       IF WA-SALES-AMOUNT > 0
BB23          ADD  WA-SALES-AMOUNT  TO REGION-SALES (WA-EMP-REGION)
BB23          MOVE WA-SALES-AMOUNT  TO CALC-SALES
BB23          MOVE 0 TO CALC-COMMISSION
BB23          MOVE 'S' TO EMP-TYPE
BB23
BB23          ADD 1 to CALC-COMMISSION
BB23          CALL CWXTSUBC USING EMP-TYPE,
BB23                                CALC-SALES,
BB23                                CALC-COMMISSION
BB23       ELSE
BB23          MOVE 'UH-OH' TO REGION-COMMENT (WA-EMP-REGION).
BB23       COMPUTE EMP-COMPENSATION = WA-SALES-SALARY +
BB23                                  CALC-COMMISSION.
BB23       ADD  EMP-COMPENSATION TO GRAND-TOTAL-EMP.
BB23       CALL CWXTDATE USING END-OF-MONTH-SW
BB23                             YRS-OF-SERVICE
BB23                             TODAYS-DATE
BB23                             WA-EMP-HIRE-DATE.
BB23       PERFORM 5000-STORE-EMPLOYEE-DETAIL.
BB23       SET HOLD-IX UP BY 1.
BB23  ***
BB23  ***  PROCESS TYPE M (MANAGEMENT) RECORDS.  THE MANAGER NAME AND
BB23  ***  SALARY ARE STORED IN A TABLE FOR USE DURING PRINTING OF THE
BB23  ***  REGIONAL SALES REPORT.
BB23  ***
BB23   4000-PROCESS-MANAGEMENT.
BB23       MOVE WA-EMP-NAME    TO REGION-MANAGER (WA-EMP-REGION).
BB23       MOVE WA-MGMT-SALARY TO REGION-SALARY (WA-EMP-REGION).
BB23       ADD 1 TO WA-EMP-HOURS.
BB23
BB23
BB23  ***
BB23  ***  SALES AND HOURLY EMPLOYEE DATA IS STORED IN A HOLD TABLE FOR
BB23  ***  PRINTING OF EMPLOYEE COMPENSATION REPORT.  THE HOLD TABLE IS
BB23  ***  A TWO-DIMENSIONAL TABLE AND HOLDS DATA FOR A MAXIMUM OF 20
BB23  ***  EMPLOYEES.
BB23  ***
BB23   5000-STORE-EMPLOYEE-DETAIL.
BB23       PERFORM 5100-SET-INDEX.
BB23       IF VALID-REGION
BB23           MOVE WA-EMP-NAME TO HOLD-NAME (REG-IX, HOLD-IX)
BB23           MOVE REGION-ID (WA-EMP-REGION)
BB23                            TO HOLD-REGION (REG-IX, HOLD-IX)
BB23           MOVE WA-EMP-TYPE TO HOLD-TYPE (REG-IX, HOLD-IX)
BB23           MOVE WA-EMP-HIRE-DATE TO HOLD-HIRE-DATE (REG-IX, HOLD-IX)
BB23           MOVE YRS-OF-SERVICE TO HOLD-YEARS (REG-IX, HOLD-IX)
BB23           MOVE EMP-COMPENSATION
BB23                            TO HOLD-TOTAL (REG-IX, HOLD-IX)
BB23           IF HOURLY
BB23              MOVE EMP-WAGES TO HOLD-WAGES (REG-IX, HOLD-IX)
BB23              MOVE OT-AMOUNT TO HOLD-OT (REG-IX, HOLD-IX)
BB23              MOVE ZEROS     TO HOLD-COMM (REG-IX, HOLD-IX)
BB23           ELSE
BB23              MOVE WA-SALES-SALARY
BB23                             TO HOLD-WAGES(REG-IX, HOLD-IX)
BB23              MOVE CALC-COMMISSION
BB23                             TO HOLD-COMM (REG-IX, HOLD-IX)
BB23              MOVE ZERO      TO HOLD-OT   (REG-IX, HOLD-IX).
BB23  ***
BB23  ***  SET THE REGION INDEX BASED ON EMPLOYEE REGION ID AND
BB23  ***  SEQUENTIALLY INCREMENT HOLD INDEX WITHIN EACH REGION.
BB23  ***  THE EMPLOYEE COMPENSATION REPORT WILL BE GROUPED BY
BB23  ***  REGION.  IF AN INVALID REGION IS FOUND, AN ERROR MESSAGE
BB23  ***  IS WRITTEN AND PROCESSING CONTINUES.
BB23  ***
BB23   5100-SET-INDEX.
BB23       MOVE 'N' TO REGION-ERROR-SW.
BB23       IF NORTH
BB23           ADD 1 TO NORTH-COUNT
BB23           SET HOLD-IX TO NORTH-COUNT
BB23       ELSE
BB23           IF SOUTH
BB23               ADD 1 TO SOUTH-COUNT
BB23               SET HOLD-IX TO SOUTH-COUNT
BB23           ELSE
BB23               IF EAST
BB23                   ADD 1 TO EAST-COUNT
BB23                   SET HOLD-IX TO EAST-COUNT
BB23               ELSE
BB23                   IF WEST
BB23                       ADD 1 TO WEST-COUNT
BB23                       SET HOLD-IX TO WEST-COUNT
BB23                   ELSE
BB23                       MOVE 'Y' TO REGION-ERROR-SW.
BB23       IF VALID-REGION
BB23           SET REG-IX TO WA-EMP-REGION.
BB23  ***
BB23  ***  COMPENSATION DATA FOR HOURLY AND SALES EMPLOYEES ARE PRINTED
BB23  ***  TO THE EMPLOYEE COMPENSATION REPORT FROM THE HOLD TABLE.
BB23  ***
BB23   6000-PRINT-EMPLOYEE-REPORT.
BB23       SET REG-IX TO 1.
BB23       PERFORM 6100-PRINT-EMPLOYEE-DETAIL
BB23             VARYING HOLD-IX FROM 1 BY 1
BB23             UNTIL HOLD-IX > NORTH-COUNT.
BB23       SET REG-IX TO 2.
BB23       PERFORM 6100-PRINT-EMPLOYEE-DETAIL
BB23             VARYING HOLD-IX FROM 1 BY 1
BB23             UNTIL HOLD-IX > SOUTH-COUNT.
BB23       SET REG-IX TO 3.
BB23       PERFORM 6100-PRINT-EMPLOYEE-DETAIL
BB23             VARYING HOLD-IX FROM 1 BY 1
BB23             UNTIL HOLD-IX > EAST-COUNT.
BB23       SET REG-IX TO 4.
BB23       PERFORM 6100-PRINT-EMPLOYEE-DETAIL
BB23             VARYING HOLD-IX FROM 1 BY 1
BB23             UNTIL HOLD-IX > WEST-COUNT.
BB23       WRITE REPORT-RECORD FROM BLANK-LINE.
BB23       MOVE GRAND-TOTAL-EMP TO EMP-GRAND-TOTAL.
BB23       WRITE REPORT-RECORD FROM EMP-TOTAL-DTL.
BB23  ***
BB23  ***  PRINT DETAIL LINES FOR EMPLOYEE COMPENSATION REPORT
BB23  ***
BB23   6100-PRINT-EMPLOYEE-DETAIL.
BB23       IF EMP-LINE-COUNT GREATER THAN 55
BB23             PERFORM 6200-PRINT-EMPLOYEE-HEADERS.
BB23       MOVE HOLD-NAME   (REG-IX, HOLD-IX) TO EMP-DTL-NAME.
BB23       MOVE HOLD-REGION (REG-IX, HOLD-IX) TO EMP-DTL-REGION.
BB23       MOVE HOLD-TYPE   (REG-IX, HOLD-IX) TO EMP-DTL-TYPE.
BB23       MOVE HOLD-HIRE-MM(REG-IX, HOLD-IX) TO EMP-DTL-HIRE-MM.
BB23       MOVE '/'                           TO EMP-DTL-SLASH1.
BB23       MOVE HOLD-HIRE-DD(REG-IX, HOLD-IX) TO EMP-DTL-HIRE-DD.
BB23       MOVE '/'                           TO EMP-DTL-SLASH2.
BB23       MOVE HOLD-HIRE-YY(REG-IX, HOLD-IX) TO EMP-DTL-HIRE-YY.
BB23       MOVE HOLD-YEARS  (REG-IX, HOLD-IX) TO EMP-DTL-YRS-OF-SERVICE.
BB23       MOVE HOLD-WAGES  (REG-IX, HOLD-IX) TO EMP-DTL-WAGES.
BB23       MOVE HOLD-OT     (REG-IX, HOLD-IX) TO EMP-DTL-OT.
BB23       MOVE HOLD-COMM   (REG-IX, HOLD-IX) TO EMP-DTL-COMM.
BB23       MOVE HOLD-TOTAL  (REG-IX, HOLD-IX) TO EMP-DTL-TOTAL.
BB23       WRITE REPORT-RECORD FROM EMPLOYEE-DTL
BB23         AFTER ADVANCING 1 LINE.
BB23       ADD  1 TO EMP-LINE-COUNT.
BB23       MOVE SPACES TO EMPLOYEE-DTL.
BB23  ***
BB23  ***  PRINT HEADERS FOR EMPLOYEE COMPENSATION REPORT
BB23  ***
BB23   6200-PRINT-EMPLOYEE-HEADERS. *> bonjour
BB23           MOVE PAGE-COUNT TO EMP-PAGE.
BB23           MOVE DATE-YY TO EMP-RUN-YY.
BB23           MOVE DATE-MM TO EMP-RUN-MM.
BB23           MOVE DATE-DD TO EMP-RUN-DD.
BB23           WRITE REPORT-RECORD FROM BLANK-LINE.
BB23           WRITE REPORT-RECORD FROM BLANK-LINE.
BB23           WRITE REPORT-RECORD FROM BLANK-LINE.
BB23           WRITE REPORT-RECORD FROM EMPLOYEE-HDR1.
BB23           WRITE REPORT-RECORD FROM BLANK-LINE.
BB23           WRITE REPORT-RECORD FROM BLANK-LINE.
BB23           WRITE REPORT-RECORD FROM EMPLOYEE-HDR2.
BB23           WRITE REPORT-RECORD FROM EMPLOYEE-HDR3.
BB23           WRITE REPORT-RECORD FROM BLANK-LINE.
BB23           ADD 1 TO PAGE-COUNT.
BB23           MOVE 5 TO EMP-LINE-COUNT.
BB23  ***
BB23  ***  COMPENSATION DATA FOR MANAGEMENT EMPLOYEES IS PRINTED
BB23  ***  TO THE REGIONAL SALES REPORT.  THE TOTAL SALES FOR THE
BB23  ***  REGION IS PASSED TO THE CALLED PROGRAM WHICH CALCULATES
BB23  ***  COMMISSION.  THIS REPORT IS GENERATED AT END-OF-MONTH.
BB23  ***
BB23   7000-PRINT-REGION-REPORT.
BB23       IF REG-LINE-COUNT GREATER THAN 55
BB23           PERFORM 7100-PRINT-REGION-HEADERS.
BB23       MOVE SPACES TO REGION-DETAIL.
BB23       MOVE REGION-NAME    (REGION-SUB) TO REG-DTL-REGION.
BB23       MOVE REGION-MANAGER (REGION-SUB) TO REG-DTL-MANAGER.
BB23       MOVE REGION-SALARY  (REGION-SUB) TO REG-DTL-SALARY.
BB23       MOVE REGION-SALES   (REGION-SUB) TO REG-DTL-SALES.
BB23       MOVE REGION-SALES   (REGION-SUB) TO CALC-SALES.
BB23       MOVE REGION-COMMENT (REGION-SUB) TO REG-DTL-COMMENT.
BB23       MOVE 'M' TO EMP-TYPE.
BB23       CALL CWXTSUBC USING EMP-TYPE,
BB23                             CALC-SALES,
BB23                             CALC-COMMISSION.
BB23       MOVE CALC-COMMISSION TO REG-DTL-COMM.
BB23       move WA-EMP-HIRE-MM to TOTAL-FIELDS.
BB23
BB23       COMPUTE MGMT-COMPENSATION = CALC-COMMISSION +
BB23                                  REGION-SALARY(REGION-SUB).
BB23       ADD  MGMT-COMPENSATION TO GRAND-TOTAL-MGMT.
BB23       MOVE MGMT-COMPENSATION TO REG-DTL-TOTAL.
BB23       WRITE REPORT-RECORD FROM REGION-DETAIL.
BB23       IF REGION-SUB = 4
BB23          WRITE REPORT-RECORD FROM BLANK-LINE
BB23          MOVE GRAND-TOTAL-MGMT TO MGMT-GRAND-TOTAL
BB23          WRITE REPORT-RECORD FROM MGMT-TOTAL-DTL.
BB23       ADD 1 TO REG-LINE-COUNT.
BB23       ADD 1 TO REGION-SUB.
BB23  ***
BB23  ***  PRINT HEADERS FOR REGIONAL SALES REPORT
BB23  ***
BB23   7100-PRINT-REGION-HEADERS.
BB23           MOVE PAGE-COUNT TO REG-PAGE.
BB23           MOVE DATE-YY TO REG-RUN-YEAR.
BB23           MOVE DATE-MM TO REG-RUN-MONTH.
BB23           MOVE DATE-DD TO REG-RUN-DAY.
BB23           WRITE REPORT-RECORD FROM BLANK-LINE.
BB23           WRITE REPORT-RECORD FROM BLANK-LINE.
BB23           WRITE REPORT-RECORD FROM BLANK-LINE.
BB23           WRITE REPORT-RECORD FROM BLANK-LINE.
BB23           WRITE REPORT-RECORD FROM BLANK-LINE.
BB23           WRITE REPORT-RECORD FROM REGION-HDR1.
BB23           WRITE REPORT-RECORD FROM BLANK-LINE.
BB23           WRITE REPORT-RECORD FROM BLANK-LINE.
BB23           WRITE REPORT-RECORD FROM REGION-HDR2.
BB23           WRITE REPORT-RECORD FROM BLANK-LINE.
BB23           ADD 1 TO PAGE-COUNT.
BB23           MOVE 4 TO REG-LINE-COUNT.
BB23  ***
BB23  ***
BB23   8000-READ-INPUT.
BB23       READ EMPLOYEE-FILE INTO EMPLOYEE-WORK-AREA
BB23           AT END
BB23                MOVE 'Y' TO EOF-SW.
BB23       ADD 1 TO RECORDS-READ.
BB23  ***
BB23  ***
BB23   9000-OPEN.
BB23       OPEN INPUT  EMPLOYEE-FILE.
BB23       OPEN OUTPUT REPORT-FILE.
BB23  ***
BB23  ***  VALID PARMS ARE BLANK OR 5 DIGIT NUMBER
BB23  ***
BB23   9100-CHECK-PARM.
BB23       IF PARM-LTH = 5
BB23           IF PARM-DATA IS NUMERIC
BB23               MOVE PARM-DATA TO START-NUMBER
BB23           ELSE
BB23               PERFORM 9800-BAD-PARM
BB23       ELSE
BB23           IF PARM-LTH = 0
BB23               MOVE 1 TO START-NUMBER
BB23           ELSE
BB23               PERFORM 9800-BAD-PARM.
BB23  ***
BB23  ***
BB23   9200-INIT.
BB23       MOVE 'NORTH' TO REGION-NAME (1).
BB23       MOVE 'SOUTH' TO REGION-NAME (2).
BB23       MOVE 'EAST ' TO REGION-NAME (3).
BB23       MOVE 'WEST ' TO REGION-NAME (4).
BB23       MOVE 1 TO REGION-SUB.
BB23       PERFORM 9300-INITIALIZE-REGION-TABLE
BB23          UNTIL REGION-SUB > 4.
BB23       SET HOLD-IX TO 1.
BB23       ACCEPT TODAYS-DATE FROM DATE.
BB23       CALL CWXTDATE USING END-OF-MONTH-SW
BB23                             YRS-OF-SERVICE
BB23                             TODAYS-DATE
BB23                             WA-EMP-HIRE-DATE.
BB23  ***
BB23  ***
BB23   9300-INITIALIZE-REGION-TABLE.
BB23       MOVE SPACES TO REGION-MANAGER (REGION-SUB).
BB23       MOVE SPACES TO REGION-COMMENT (REGION-SUB).
BB23       MOVE 0 TO REGION-SALARY (REGION-SUB).
BB23       MOVE 0 TO REGION-SALES  (REGION-SUB).
BB23       ADD  1 TO REGION-SUB.
BB23  ***
BB23  ***
BB23   9800-BAD-PARM.
BB23       MOVE 'Y' TO PARM-ERROR-SW.
BB23       MOVE '   PARAMETER LENGTH OR DATA IS INCORRECT   '
BB23           TO ERROR-LINE.
BB23       WRITE REPORT-RECORD FROM ERROR-LINE.
BB23  ***
BB23  ***
BB23   9900-CLOSE.
BB23       CLOSE EMPLOYEE-FILE.
BB23       CLOSE REPORT-FILE.
BB23  ***
BB23  ***
BB23   9999-RIP.
BB23       DISPLAY '    ************    '.
BB23       DISPLAY '   *            *   '.
BB23       DISPLAY '  *   T H I S    *  '.
BB23       DISPLAY ' *                * '.
BB23       DISPLAY ' *      I S       * '.
BB23       DISPLAY ' *                * '.
BB23       DISPLAY ' *    D E A D     * '.
BB23       DISPLAY ' *                * '.
BB23       DISPLAY ' *    C O D E     * '.
BB23       DISPLAY ' ****************** '.