000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.    TPIPE11.
000300 AUTHOR.        KICKOFF PIPELINE TRAINING.
002600 ENVIRONMENT DIVISION.
002700 CONFIGURATION SECTION.
002800 SOURCE-COMPUTER. IBM-370.
002900 OBJECT-COMPUTER. IBM-370.
003100 INPUT-OUTPUT SECTION.
003200 FILE-CONTROL.
004700 DATA DIVISION.
007000 WORKING-STORAGE SECTION.
008300 PROCEDURE DIVISION.
008700     DISPLAY 'KICKOFF TRAINING'.
015000     EXIT.