//PFHSXK9X JOB (MISTEC),'Topaz Demo',CLASS=A,MSGCLASS=X,
//         MSGLEVEL=(1,1),NOTIFY=&SYSUID,REGION=4M
//*
//*
//*   EXECUTION JCL FOR COBOL DEMO PROGRAM CWCBPOS7
//*
//CWXTCOB  EXEC PGM=CWBBPGM4,PARM=00003
//*
//STEPLIB  DD  DISP=SHR,DSN=SALESSUP.ISPW.PLAY.DEV1.LOAD
//*
//EMPFILE  DD  DISP=SHR,DSN=SALESSUP.XPEDITER.ISPW.DATA(CWXTDATA)
//RPTFILE  DD  SYSOUT=*
//SYSOUT   DD  SYSOUT=*
//*