       01  :XXX-:RECORD.
          05 :XXX-:ID        PIC 9(5).
          05 :XXX-:NAME      PIC X(30).
          05 :XXX-:BALANCE   PIC S9(7)V99.
